1c/standalone/src/InformationRegisters/Кабиторий_ОбработанныеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Кабиторий_ОбработанныеСообщения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>d5p1:DocumentRef.Кабиторий_ОказаниеУслуги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1c/standalone/src/InformationRegisters/Кабиторий_ОбработанныеСообщения/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Синтезирует идентификатор сообщения из кода отправителя и бизнес-ключа (§19, INV-10).
// Применять, когда сообщение не несёт собственного messageId. Слабый синтез
// (сумма+дата) недопустим - даёт коллизии и потерю сообщений; нужны ключи,
// гарантирующие уникальность в рамках источника (напр. providerCode + externalTxId).
//
// Параметры:
//   КодПоставщика - Строка - идентификатор источника (providerCode)
//   ВнешнийКлюч - Строка - бизнес-ключ, уникальный в рамках источника (externalTxId)
//
// Возвращаемое значение:
//   Строка - синтезированный идентификатор сообщения
//
Функция СинтезироватьИдентификатор(КодПоставщика, ВнешнийКлюч) Экспорт

	Если НЕ ЗначениеЗаполнено(КодПоставщика) Или НЕ ЗначениеЗаполнено(ВнешнийКлюч) Тогда
		ВызватьИсключение "Синтез идентификатора требует код поставщика и внешний ключ";
	КонецЕсли;

	Возврат КодПоставщика + "|" + ВнешнийКлюч;

КонецФункции

// Накладывает исключительную блокировку на сообщение ДО чтения регистра (требует
// активной транзакции). Без неё два параллельных потока оба увидят «записи нет» и
// дважды исполнят эффект.
//
// Параметры:
//   ИдентификаторСообщения - Строка - messageId
//
Процедура ЗаблокироватьСообщение(ИдентификаторСообщения) Экспорт

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.Кабиторий_ОбработанныеСообщения");
	ЭлементБлокировки.УстановитьЗначение("ИдентификаторСообщения", ИдентификаторСообщения);
	Блокировка.Заблокировать();

КонецПроцедуры

// Проверяет, было ли сообщение уже обработано (дедуп). Вызывать ПОД блокировкой.
//
// Параметры:
//   ИдентификаторСообщения - Строка - messageId
//
// Возвращаемое значение:
//   Булево - Истина, если сообщение уже зафиксировано как обработанное
//
Функция СообщениеОбработано(ИдентификаторСообщения) Экспорт

	МенеджерЗаписи = МенеджерЗаписиПоИдентификатору(ИдентификаторСообщения);
	МенеджерЗаписи.Прочитать();
	Возврат МенеджерЗаписи.Выбран();

КонецФункции

// Фиксирует факт обработки сообщения (запись в одном коммите с эффектом).
//
// Параметры:
//   ИдентификаторСообщения - Строка - messageId
//   Заявка - ДокументСсылка.Кабиторий_ОказаниеУслуги - затронутый агрегат (если есть)
//   ВидСообщения - Строка - тип/источник сообщения (для трассировки)
//   Результат - Строка - краткий исход обработки
//
Процедура ЗафиксироватьОбработку(ИдентификаторСообщения, Заявка = Неопределено, ВидСообщения = "", Результат = "") Экспорт

	МенеджерЗаписи = МенеджерЗаписиПоИдентификатору(ИдентификаторСообщения);
	Если Заявка <> Неопределено Тогда
		МенеджерЗаписи.Заявка = Заявка;
	КонецЕсли;
	МенеджерЗаписи.ВидСообщения = Лев(ВидСообщения, 100);
	МенеджерЗаписи.Результат = Лев(Результат, 500);
	МенеджерЗаписи.Обработано = ТекущаяДатаСеанса();
	МенеджерЗаписи.Записать();

КонецПроцедуры

// Возвращает запись об обработанном сообщении структурой (или Неопределено).
//
// Параметры:
//   ИдентификаторСообщения - Строка - messageId
//
// Возвращаемое значение:
//   Структура, Неопределено - поля записи
//
Функция ПолучитьСообщение(ИдентификаторСообщения) Экспорт

	МенеджерЗаписи = МенеджерЗаписиПоИдентификатору(ИдентификаторСообщения);
	МенеджерЗаписи.Прочитать();

	Если НЕ МенеджерЗаписи.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторСообщения", МенеджерЗаписи.ИдентификаторСообщения);
	Результат.Вставить("Заявка", МенеджерЗаписи.Заявка);
	Результат.Вставить("ВидСообщения", МенеджерЗаписи.ВидСообщения);
	Результат.Вставить("Обработано", МенеджерЗаписи.Обработано);
	Результат.Вставить("Результат", МенеджерЗаписи.Результат);

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создаёт менеджер записи с установленным идентификатором сообщения.
//
// Параметры:
//   ИдентификаторСообщения - Строка - messageId
//
// Возвращаемое значение:
//   РегистрСведенийМенеджерЗаписи.Кабиторий_ОбработанныеСообщения
//
Функция МенеджерЗаписиПоИдентификатору(ИдентификаторСообщения)

	МенеджерЗаписи = РегистрыСведений.Кабиторий_ОбработанныеСообщения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторСообщения = ИдентификаторСообщения;
	Возврат МенеджерЗаписи;

КонецФункции

#КонецОбласти
